In [3]:
import pandas as pd ; import numpy as np

In [4]:
s = pd.Series(["ege",np.nan,"ali","eda"])
# np.nan numpyda eksik veri old anlamına gelir

In [5]:
s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [7]:
s.isnull()
# true yazan yerde eksik veri vardır

0    False
1     True
2    False
3    False
dtype: bool

In [8]:
s.notnull()
# isnull tersi

0     True
1    False
2     True
3     True
dtype: bool

In [9]:
s[3]=None
# artık 3. indexteki veride eksik veri oldu

In [10]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
s.dropna() 
# eksik verileri kaldırır

0    ege
2    ali
dtype: object

In [13]:
from numpy import nan as NA
# np.nan yazmak yrrine bunu NA diye atadık

In [15]:
df= pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [16]:
df.dropna(how="all")
# bütün verileri eksik olan satır kaldırıldı

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [18]:
df[1]=NA

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [20]:
df.dropna(axis=1, how="all")
# tüm verileri eksik olan sütunu kaldırdık

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [21]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [22]:
df.dropna(thresh=1)
# veri setinde en az bir tane verisi bile olan
# satırlar ekrana yazılır 2 olursa 2 tane en az olması lazım

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [23]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [24]:
df.fillna(0)
# eksik verilerin yerine 0 yazdırdık

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [26]:
df.fillna({0:15,1:20,2:35})
# sıfırıncı sütunda eksik veri yerine 15
# birinici sütunda eksik veri yerine 20
# ikinci sütunda eksik veri yerine 35 yazdık
# ama bunlar kalıcı olmuyor

      0     1     2
0   1.0  20.0   3.0
1   4.0  20.0   5.0
2  15.0  20.0  35.0

In [27]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [29]:
df.fillna(0,inplace=True)
# eksik verilerin yerine 0 yazdık kalıcı oldu

In [30]:
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [31]:
df= pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [32]:
df.fillna(method="ffill")
# Bu uyarı, fillna yönteminde "method" parametresinin kullanımının gelecekteki sürümlerde kaldırılacağını belirtmektedir. 
# Bunun yerine ffill() veya bfill() yöntemlerini kullanmanız önerilir.
# ffill() yöntemi (forward fill), eksik değerleri bir sonraki mevcut değerle doldururken
# bfill() yöntemi (backward fill), eksik değerleri bir önceki mevcut değerle doldurur.

C:\Users\ibrahim\AppData\Local\Temp\ipykernel_26776\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [33]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [35]:
df.fillna(method="ffill",limit=1)
# her sütundaki en az 1 eksik veri tamamlandı

C:\Users\ibrahim\AppData\Local\Temp\ipykernel_26776\915859635.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [45]:
import pandas as pd ; import numpy as np

In [46]:
from  numpy  import nan as NA

In [48]:
veri=pd.Series([1,0,NA,5])
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [49]:
veri.fillna(veri.mean())
# eksik veri yerine ort. yazdırdı

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [50]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [51]:
df.fillna(df.mean())
# toplam/adet yaparken eksik veri sayılmaz

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0